fedetft/miosix-kernel/miosix/arch/drivers/sdmmc/stm32f1_sd.cpp
/***************************************************************************
 *   Copyright (C) 2010, 2011, 2012, 2013, 2014 by Terraneo Federico       *
 *                                                                         *
 *   This program is free software; you can redistribute it and/or modify  *
 *   it under the terms of the GNU General Public License as published by  *
 *   the Free Software Foundation; either version 2 of the License, or     *
 *   (at your option) any later version.                                   *
 *                                                                         *
 *   This program is distributed in the hope that it will be useful,       *
 *   but WITHOUT ANY WARRANTY; without even the implied warranty of        *
 *   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the         *
 *   GNU General Public License for more details.                          *
 *                                                                         *
 *   As a special exception, if other files instantiate templates or use   *
 *   macros or inline functions from this file, or you compile this file   *
 *   and link it with other works to produce a work based on this file,    *
 *   this file does not by itself cause the resulting work to be covered   *
 *   by the GNU General Public License. However the source code for this   *
 *   file must still be made available in accordance with the GNU General  *
 *   Public License. This exception does not invalidate any other reasons  *
 *   why a work based on this file might be covered by the GNU General     *
 *   Public License.                                                       *
 *                                                                         *
 *   You should have received a copy of the GNU General Public License     *
 *   along with this program; if not, see <http://www.gnu.org/licenses/>   *
 ***************************************************************************/

#include "stm32f1_sd.h"
#include "interfaces/bsp.h"
#include "interfaces/arch_registers.h"
#include "interfaces/interrupts.h"
#include "interfaces/delays.h"
#include "kernel/thread.h"
#include "board_settings.h" //For sdVoltage
#include <cstdio>
#include <cstring>
#include <errno.h>

/*
 * This driver is quite a bit complicated, due to a silicon errata in the
 * STM32F1 microcontrollers, that prevents concurrent access to the FSMC
 * (i.e., the external memory controller) by both the CPU and DMA.
 * Therefore, if __ENABLE_XRAM is defined, the SDIO peripheral is used in
 * polled mode, otherwise in DMA mode. The use in polled mode is further
 * complicated by the fact that the SDIO peripheral does not halt the clock
 * to the SD card if its internal fifo is full. Therefore, when using the
 * SDIO in polled mode the only solution is to disable interrupts during
 * the data transfer. To optimize reading and writing speed this code
 * automatically chooses the best transfer speed using a binary search during
 * card initialization. Also, other sources of mess are the requirement for
 * word alignment of pointers when doing DMA transfers or writing to the SDIO
 * peripheral. Because of that, tryng to fwrite() large bloks of data is faster
 * if they are word aligned. An easy way to do so is to allocate them on the
 * heap (and not doing any pointer arithmetic on the value returned by
 * malloc/new)
 */
#ifndef __ENABLE_XRAM
#define SD_DMA
#endif //__ENABLE_XRAM

//Note: enabling debugging might cause deadlock when using sleep() or reboot()
//The bug won't be fixed because debugging is only useful for driver development
///\internal Debug macro, for normal conditions
//#define DBG iprintf
#define DBG(x,...) do {} while(0)
///\internal Debug macro, for errors only
//#define DBGERR iprintf
#define DBGERR(x,...) do {} while(0)

namespace miosix {

#ifdef SD_DMA
static volatile bool driverError;       ///< \internal Errors caused by OS issues (premature wakeup)
static volatile bool dmaTransferError;  ///< \internal DMA transfer error
static volatile bool sdioTransferError; ///< \internal SDIO transfer error
static Thread *waiting;                 ///< \internal Thread waiting for transfer
static unsigned int dmaFlags;           ///< \internal DMA status flags
static unsigned int sdioFlags;          ///< \internal SDIO status flags

/**
 * \internal
 * DMA2 Channel4 interrupt handler actual implementation
 */
void DMA2channel4irqImpl()
{
    dmaFlags=DMA2->ISR;
    if(dmaFlags & DMA_ISR_TEIF4) dmaTransferError=true;
    
    DMA2->IFCR=DMA_IFCR_CGIF4;
    
    if(!waiting) return;
    waiting->IRQwakeup();
    waiting=nullptr;
}

/**
 * \internal
 * DMA2 Channel4 interrupt handler actual implementation
 */
void SDIOirqImpl()
{
    sdioFlags=SDIO->STA;
    if(sdioFlags & (SDIO_STA_STBITERR | SDIO_STA_RXOVERR  |
                    SDIO_STA_TXUNDERR | SDIO_STA_DTIMEOUT | SDIO_STA_DCRCFAIL))
        sdioTransferError=true;
    
    SDIO->ICR=0x7ff;//Clear flags
    
    if(!waiting) return;
    waiting->IRQwakeup();
    waiting=nullptr;
}
#endif //SD_DMA

/*
 * Operating voltage of device. It is sent to the SD card to check if it can
 * work at this voltage. Range *must* be within 28..36
 * Example 33=3.3v
 */
//const unsigned char sdVoltage=33; //Is defined in board_settings.h
const unsigned int sdVoltageMask=1<<(sdVoltage-13); //See OCR register in SD spec

/**
 * \internal
 * Possible state of the cardType variable.
 */
enum CardType
{
    Invalid=0, ///<\internal Invalid card type
    MMC=1<<0,  ///<\internal if(cardType==MMC) card is an MMC
    SDv1=1<<1, ///<\internal if(cardType==SDv1) card is an SDv1
    SDv2=1<<2, ///<\internal if(cardType==SDv2) card is an SDv2
    SDHC=1<<3  ///<\internal if(cardType==SDHC) card is an SDHC
};

///\internal Type of card.
static CardType cardType=Invalid;

//SD card GPIOs
typedef Gpio<PC,8>  sdD0;
typedef Gpio<PC,9>  sdD1;
typedef Gpio<PC,10> sdD2;
typedef Gpio<PC,11> sdD3;
typedef Gpio<PC,12> sdCLK;
typedef Gpio<PD,2>  sdCMD;

//
// Class BufferConverter
//

/**
 * \internal
 * Convert a single buffer of *fixed* and predetermined size to and from
 * word-aligned. To do so, if the buffer is already word aligned a cast is made,
 * otherwise a new buffer is allocated.
 * Note that this class allocates at most ONE buffer at any given time.
 * Therefore any call to toWordAligned(), toWordAlignedWithoutCopy(),
 * toOriginalBuffer() or deallocateBuffer() invalidates the buffer previousy
 * returned by toWordAligned() and toWordAlignedWithoutCopy()
 */
class BufferConverter
{
public:
    /**
     * \internal
     * The buffer will be of this size only.
     */
    static const int BUFFER_SIZE=512;

    /**
     * \internal
     * \return true if the pointer is word aligned
     */
    static bool isWordAligned(const void *x)
    {
        return (reinterpret_cast<const unsigned int>(x) & 0x3)==0;
    }

    /**
     * \internal
     * Convert from a constunsigned char* buffer of size BUFFER_SIZE to a
     * const unsigned int* word aligned buffer.
     * If the original buffer is already word aligned it only does a cast,
     * otherwise it copies the data on the original buffer to a word aligned
     * buffer. Useful if subseqent code will read from the buffer.
     * \param a buffer of size BUFFER_SIZE. Can be word aligned or not.
     * \return a word aligned buffer with the same data of the given buffer
     */
    static const unsigned int *toWordAligned(const unsigned char *buffer);

    /**
     * \internal
     * Convert from an unsigned char* buffer of size BUFFER_SIZE to an
     * unsigned int* word aligned buffer.
     * If the original buffer is already word aligned it only does a cast,
     * otherwise it returns a new buffer which *does not* contain the data
     * on the original buffer. Useful if subseqent code will write to the
     * buffer. To move the written data to the original buffer, use
     * toOriginalBuffer()
     * \param a buffer of size BUFFER_SIZE. Can be word aligned or not.
     * \return a word aligned buffer with undefined content.
     */
    static unsigned int *toWordAlignedWithoutCopy(unsigned char *buffer);

    /**
     * \internal
     * Convert the buffer got through toWordAlignedWithoutCopy() to the
     * original buffer. If the original buffer was word aligned, nothing
     * happens, otherwise a memcpy is done.
     * Note that this function does not work on buffers got through
     * toWordAligned().
     */
    static void toOriginalBuffer();

    /**
     * \internal
     * Can be called to deallocate the buffer
     */
    static void deallocateBuffer();

