fedetft/miosix-kernel/miosix/arch/drivers/sdmmc/stm32f1_sd.cpp
private:
    Error error;
};


bool DataResult::validateError()
{
    switch(error)
    {
        case Ok:
            return true;
        case Timeout:
            DBGERR("Data Timeout\n");
            break;
        case CRCFail:
            DBGERR("Data CRC Fail\n");
            break;
        case RXOverrun:
            DBGERR("Data overrun\n");
            break;
        case TXUnderrun:
            DBGERR("Data underrun\n");
            break;
        case StartBitFail:
            DBGERR("Data start bit Fail\n");
            break;
    }
    return false;
}

//
// Class ClockController
//

/**
 * \internal
 * This class controls the clock speed of the SDIO peripheral. The SDIO
 * peripheral, when used in polled mode, requires two timing critical pieces of
 * code: the one to send and the one to receive a data block. This because
 * the peripheral has a 128 byte fifo while the block size is 512 byte, and
 * if fifo underrun/overrun occurs the peripheral does not pause communcation,
 * instead it simply aborts the data transfer. Since the speed of the code to
 * read/write a data block depends on too many factors, such as compiler
 * optimizations, code running from internal flash or external ram, and the
 * cpu clock speed, a dynamic clocking approach was chosen.
 */
class ClockController
{
public:

    /**
     * \internal. Set a low clock speed of 400KHz or less, used for
     * detecting SD/MMC cards. This function as a side effect enables 1bit bus
     * width, and disables clock powersave, since it is not allowed by SD spec.
     */
    static void setLowSpeedClock()
    {
        clockReductionAvailable=0;
        // No hardware flow control, SDIO_CK generated on rising edge, 1bit bus
        // width, no clock bypass, no powersave.
        // Set low clock speed 400KHz, 72MHz/400KHz-2=178
        SDIO->CLKCR=CLOCK_400KHz | SDIO_CLKCR_CLKEN;
        SDIO->DTIMER=240000; //Timeout 600ms expressed in SD_CK cycles
    }

    /**
     * \internal
     * Automatically select the data speed.
     * Since the maximum speed depends on many factors, such as code running in
     * internal or external RAM, compiler optimizations etc. this routine
     * selects the highest sustainable data transfer speed.
     * This is done by binary search until the highest clock speed that causes
     * no errors is found.
     * This function as a side effect enables 4bit bus width, and clock
     * powersave.
     */
    static void calibrateClockSpeed(SDIODriver *sdio);
    
    /**
     * \internal
     * Since clock speed is set dynamically by bynary search at runtime, a
     * corner case might be that of a clock speed which results in unreliable
     * data transfer, that sometimes succeeds, and sometimes fail.
     * For maximum robustness, this function is provided to reduce the clock
     * speed slightly in case a data transfer should fail after clock
     * calibration. To avoid inadvertently considering other kind of issues as
     * clock issues, this function can be called only MAX_ALLOWED_REDUCTIONS
     * times after clock calibration, subsequent calls will fail. This will
     * avoid other issues causing an ever decreasing clock speed.
     * \return true on success, false on failure
     */
    static bool reduceClockSpeed() { return IRQreduceClockSpeed(); }

    /**
     * \internal
     * Same as reduceClockSpeed(), can be called with interrupts disabled.
     * \return true on success, false on failure 
     */
    static bool IRQreduceClockSpeed();

    /**
     * \internal
     * Read and write operation do retry during normal use for robustness, but
     * during clock claibration they must not retry for speed reasons. This
     * member function returns 1 during clock claibration and MAX_RETRY during
     * normal use.
     */
    static unsigned char getRetryCount() { return retries; }

private:
    /**
     * Set SDIO clock speed
     * \param clkdiv speed is SDIOCLK/(clkdiv+2) 
     */
    static void setClockSpeed(unsigned int clkdiv);
    
    /**
     * \internal
     * Value of SDIO->CLKCR that will give a 400KHz clock, depending on cpu
     * clock speed.
     */
    static const unsigned int CLOCK_400KHz=cpuFrequency/400000-2;

    ///\internal Clock enabled, bus width 4bit, clock powersave enabled.
    static const unsigned int CLKCR_FLAGS=SDIO_CLKCR_CLKEN |
        SDIO_CLKCR_WIDBUS_0 | SDIO_CLKCR_PWRSAV;
    
    ///\internal Maximum number of calls to IRQreduceClockSpeed() allowed
    ///When using polled mode this is a critical parameter, if SDIO driver
    ///starts to fail, it might be a good idea to increase this
    static const unsigned char MAX_ALLOWED_REDUCTIONS=7;

    ///\internal value returned by getRetryCount() while *not* calibrating clock.
    ///When using polled mode this is a critical parameter, if SDIO driver
    ///starts to fail, it might be a good idea to increase this
    static const unsigned char MAX_RETRY=10;

    ///\internal Used to allow only one call to reduceClockSpeed()
    static unsigned char clockReductionAvailable;

    static unsigned char retries;
};

void ClockController::calibrateClockSpeed(SDIODriver *sdio)
{
    //During calibration we call readBlock which will call reduceClockSpeed()
    //so not to invalidate calibration clock reduction must not be available
    clockReductionAvailable=0;
    retries=1;

    DBG("Automatic speed calibration\n");
    unsigned int buffer[512/sizeof(unsigned int)];
    unsigned int minFreq=CLOCK_400KHz; //400KHz, independent of CPU clock
    unsigned int maxFreq=1;            //24MHz  with CPU running @ 72MHz
    unsigned int selected;
    while(minFreq-maxFreq>1)
    {
        selected=(minFreq+maxFreq)/2;
        DBG("Trying CLKCR=%d\n",selected);
        setClockSpeed(selected);
        if(sdio->readBlock(reinterpret_cast<unsigned char*>(buffer),512,0)==512)
            minFreq=selected;
        else maxFreq=selected;
    }
    //Last round of algorithm
    setClockSpeed(maxFreq);
    if(sdio->readBlock(reinterpret_cast<unsigned char*>(buffer),512,0)==512)
    {
        DBG("Optimal CLKCR=%d\n",maxFreq);
    } else {
        setClockSpeed(minFreq);
        DBG("Optimal CLKCR=%d\n",minFreq);
    }

    //Make clock reduction available
    clockReductionAvailable=MAX_ALLOWED_REDUCTIONS;
    retries=MAX_RETRY;
}

bool ClockController::IRQreduceClockSpeed()
{
    //Ensure this function can be called only twice per calibration
    if(clockReductionAvailable==0) return false;
    clockReductionAvailable--;

