fedetft/miosix-kernel/miosix/arch/drivers/sdmmc/stm32f1_sd.cpp
    unsigned int currentClkcr=SDIO->CLKCR & 0xff;
    if(currentClkcr==CLOCK_400KHz) return false; //No lower than this value

    //If the value of clockcr is low, increasing it by one is enough since
    //frequency changes a lot, otherwise increase by 2.
    if(currentClkcr<10) currentClkcr++;
    else currentClkcr+=2;
    
    setClockSpeed(currentClkcr);
    return true;
}

void ClockController::setClockSpeed(unsigned int clkdiv)
{
    //Don't enable hardware flow control even if SD_KEEP_CARD_SELECTED on stm32f1
    SDIO->CLKCR=clkdiv | CLKCR_FLAGS;
    //Timeout 600ms expressed in SD_CK cycles
    SDIO->DTIMER=(6*SystemCoreClock)/((clkdiv+2)*10);
}

unsigned char ClockController::clockReductionAvailable=false;
unsigned char ClockController::retries=ClockController::MAX_RETRY;

//
// Data send/receive functions
//

/**
 * \internal
 * Wait until the card is ready for data transfer.
 * Can be called independently of the card being selected.
 * \return true on success, false on failure
 */
static bool waitForCardReady()
{
    //The card may remain busy for up to 500ms and there appears to be no way
    //to set an interrupt to wait until it becomes ready again. We can't just
    //poll for that long as if a high priority thread is stuck polling all lower
    //priority threads block, so we are forced to do a sleep. The initial value
    //of 2ms was found to be impacting performance excessively, so we take
    //advantage of high resolution timers by sleeping for 200us, and fallback to
    //the previous value only for slow configurations
    #if !defined(__CODE_IN_XRAM)
    const long long sleepTime=200000;
    #else
    const long long sleepTime=2000000;
    #endif
    long long timeout=getTime()+1500000000; //Timeout 1.5 second
    do {
        CmdResult cr=Command::send(Command::CMD13,Command::getRca()<<16);
        if(cr.validateR1Response()==false) return false;
        //Bit 8 in R1 response means ready for data.
        if(cr.getResponse() & (1<<8)) return true;
        Thread::nanoSleep(sleepTime);
    } while(getTime()<timeout);
    DBGERR("Timeout waiting card ready\n");
    return false;
}

#ifndef SD_DMA

/**
 * \internal
 * Receive a data block. The end of the data block must be told to the SDIO
 * peripheral in SDIO->DLEN and must match the size parameter given to this
 * function.
 * \param buffer buffer where to store received data. Its size must be >=size
 * \param buffer size, which *must* be multiple of 8 words (32bytes)
 * Note that the size parameter must be expressed in word (4bytes), while
 * the value in SDIO->DLEN is expressed in bytes.
 * \return a DataResult object
 */
static DataResult IRQreceiveDataBlock(unsigned int *buffer, unsigned int size)
{
    // A note on speed.
    // Due to the auto calibration of SDIO clock speed being done with
    // IRQreceiveDataBlock(), the speed of this function must be comparable
    // with the speed of IRQsendDataBlock(), otherwise IRQsendDataBlock()
    // will fail because of data underrun.
    const unsigned int *bufend=buffer+size;
    unsigned int status;
    for(;;)
    {
        status=SDIO->STA;
        if(status & (SDIO_STA_RXOVERR | SDIO_STA_DCRCFAIL |
            SDIO_STA_DTIMEOUT | SDIO_STA_STBITERR | SDIO_STA_DBCKEND)) break;
        if((status & SDIO_STA_RXFIFOHF) && (buffer!=bufend))
        {
            //Read 8 words from the fifo, loop entirely unrolled for speed
            *buffer=SDIO->FIFO; buffer++;
            *buffer=SDIO->FIFO; buffer++;
            *buffer=SDIO->FIFO; buffer++;
            *buffer=SDIO->FIFO; buffer++;
            *buffer=SDIO->FIFO; buffer++;
            *buffer=SDIO->FIFO; buffer++;
            *buffer=SDIO->FIFO; buffer++;
            *buffer=SDIO->FIFO; buffer++;
        }
    }
    SDIO->ICR=0x7ff;//Clear flags
    if(status & SDIO_STA_RXOVERR) return DataResult(DataResult::RXOverrun);
    if(status & SDIO_STA_DCRCFAIL) return DataResult(DataResult::CRCFail);
    if(status & SDIO_STA_DTIMEOUT) return DataResult(DataResult::Timeout);
    if(status & SDIO_STA_STBITERR) return DataResult(DataResult::StartBitFail);
    //Read eventual data left in the FIFO
    for(;;)
    {
        if((SDIO->STA & SDIO_STA_RXDAVL)==0) break;
        *buffer=SDIO->FIFO; buffer++;
    }
    return DataResult(DataResult::Ok);
}

/**
 * \internal
 * Send a data block. The end of the data block must be told to the SDIO
 * peripheral in SDIO->DLEN and must match the size parameter given to this
 * function.
 * \param buffer buffer where to store received data. Its size must be >=size
 * \param buffer size, which *must* be multiple of 8 words (32bytes).
 * Note that the size parameter must be expressed in word (4bytes), while
 * the value in SDIO->DLEN is expressed in bytes.
 * \return a DataResult object
 */
static DataResult IRQsendDataBlock(const unsigned int *buffer, unsigned int size)
{
    // A note on speed.
    // Due to the auto calibration of SDIO clock speed being done with
    // IRQreceiveDataBlock(), the speed of this function must be comparable
    // with the speed of IRQreceiveDataBlock(), otherwise this function
    // will fail because of data underrun.
    const unsigned int *bufend=buffer+size;
    unsigned int status;
    for(;;)
    {
        status=SDIO->STA;
        if(status & (SDIO_STA_TXUNDERR | SDIO_STA_DCRCFAIL |
            SDIO_STA_DTIMEOUT | SDIO_STA_STBITERR | SDIO_STA_DBCKEND)) break;
        if((status & SDIO_STA_TXFIFOHE) && (buffer!=bufend))
        {
            //Write 8 words to the fifo, loop entirely unrolled for speed
            SDIO->FIFO=*buffer; buffer++;
            SDIO->FIFO=*buffer; buffer++;
            SDIO->FIFO=*buffer; buffer++;
            SDIO->FIFO=*buffer; buffer++;
            SDIO->FIFO=*buffer; buffer++;
            SDIO->FIFO=*buffer; buffer++;
            SDIO->FIFO=*buffer; buffer++;
            SDIO->FIFO=*buffer; buffer++;
        }
    }
    SDIO->ICR=0x7ff;//Clear flags
    if(status & SDIO_STA_TXUNDERR) return DataResult(DataResult::TXUnderrun);
    if(status & SDIO_STA_DCRCFAIL) return DataResult(DataResult::CRCFail);
    if(status & SDIO_STA_DTIMEOUT) return DataResult(DataResult::Timeout);
    if(status & SDIO_STA_STBITERR) return DataResult(DataResult::StartBitFail);
    return DataResult(DataResult::Ok);
}

/**
 * \internal
 * Read a single block of 512 bytes from an SD/MMC card.
 * Card must be selected prior to caling this function.
 * \param buffer, a buffer whose size is >=512 bytes, word aligned
 * \param lba logical block address of the block to read.
 */
static bool singleBlockRead(unsigned int *buffer, unsigned int lba)
{
    if(cardType!=SDHC) lba*=512; // Convert to byte address if not SDHC

    if(waitForCardReady()==false) return false;

    CmdResult cr;
    DataResult dr;
    bool failed=true;
    for(;;)
    {
        // Since we read with polling, a context switch or interrupt here
        // would cause a fifo overrun, so we disable interrupts.
        FastGlobalIrqLock dLock;

        SDIO->DLEN=512;
        //Block size 512 bytes, block data xfer, from card to controller
        SDIO->DCTRL=(9<<4) | SDIO_DCTRL_DTDIR | SDIO_DCTRL_DTEN;

