fedetft/miosix-kernel/miosix/arch/drivers/sdmmc/stm32f1_sd.cpp
        cr=Command::IRQsend(Command::CMD17,lba);
        if(cr.IRQvalidateR1Response())
        {
            dr=IRQreceiveDataBlock(buffer,512/sizeof(unsigned int));
            SDIO->DCTRL=0; //Disable data path state machine
            
            //If failed because too slow check if it is possible to reduce speed
            if(dr.getError()==DataResult::RXOverrun)
            {
                if(ClockController::IRQreduceClockSpeed())
                {
                    //Disabling interrupts for too long is bad
                    FastGlobalIrqUnlock eLock(dLock);
                    //After an error during data xfer the card might be a little
                    //confused. So send STOP_TRANSMISSION command to reassure it
                    cr=Command::send(Command::CMD12,0);
                    if(cr.validateR1Response()) continue;
                }
            }

            if(dr.getError()==DataResult::Ok) failed=false;
        }
        break;
    }
    if(failed)
    {
        cr.validateR1Response();
        dr.validateError();
        //After an error during data xfer the card might be a little
        //confused. So send STOP_TRANSMISSION command to reassure it
        cr=Command::send(Command::CMD12,0);
        cr.validateR1Response();
        return false;
    }
    return true;
}

/**
 * \internal
 * Write a single block of 512 bytes to an SD/MMC card
 * Card must be selected prior to caling this function.
 * \param buffer, a buffer whose size is >=512 bytes
 * \param lba logical block address of the block to write.
 */
static bool singleBlockWrite(const unsigned int *buffer, unsigned int lba)
{
    if(cardType!=SDHC) lba*=512; // Convert to byte address if not SDHC

    if(waitForCardReady()==false) return false;

    bool failed=true;
    CmdResult cr;
    DataResult dr;
    for(;;)
    {
        // Since we write with polling, a context switch or interrupt here
        // would cause a fifo overrun, so we disable interrupts.
        FastGlobalIrqLock dLock;

        cr=Command::IRQsend(Command::CMD24,lba);
        if(cr.IRQvalidateR1Response())
        {
            SDIO->DLEN=512;
            //Block size 512 bytes, block data xfer, from controller to card
            SDIO->DCTRL=(9<<4) | SDIO_DCTRL_DTEN;

            dr=IRQsendDataBlock(buffer,512/sizeof(unsigned int));
            SDIO->DCTRL=0; //Disable data path state machine

            //If failed because too slow check if it is possible to reduce speed
            if(dr.getError()==DataResult::TXUnderrun)
            {
                if(ClockController::IRQreduceClockSpeed())
                {
                    //Disabling interrupts for too long is bad
                    FastGlobalIrqUnlock eLock(dLock);
                    //After an error during data xfer the card might be a little
                    //confused. So send STOP_TRANSMISSION command to reassure it
                    cr=Command::send(Command::CMD12,0);
                    if(cr.validateR1Response()) continue;
                }
            }

            if(dr.getError()==DataResult::Ok) failed=false;
        }
        break;
    }
    if(failed)
    {
        cr.validateR1Response();
        dr.validateError();
        //After an error during data xfer the card might be a little
        //confused. So send STOP_TRANSMISSION command to reassure it
        cr=Command::send(Command::CMD12,0);
        cr.validateR1Response();
        return false;
    }
    return true;
}

#else //SD_DMA

/**
 * \internal
 * Prints the errors that may occur during a DMA transfer
 */
static void displayBlockTransferError()
{
    DBGERR("Block transfer error\n");
    if(dmaFlags & DMA_ISR_TEIF4)      DBGERR("* DMA Transfer error\n");
    if(sdioFlags & SDIO_STA_STBITERR) DBGERR("* SDIO Start bit error\n");
    if(sdioFlags & SDIO_STA_RXOVERR)  DBGERR("* SDIO RX Overrun\n");
    if(sdioFlags & SDIO_STA_TXUNDERR) DBGERR("* SDIO TX Underrun error\n");
    if(sdioFlags & SDIO_STA_DCRCFAIL) DBGERR("* SDIO Data CRC fail\n");
    if(sdioFlags & SDIO_STA_DTIMEOUT) DBGERR("* SDIO Data timeout\n");
}

/**
 * \internal
 * Read a given number of contiguous 512 byte blocks from an SD/MMC card.
 * Card must be selected prior to calling this function.
 * \param buffer, a buffer whose size is 512*nblk bytes, word aligned
 * \param nblk number of blocks to read.
 * \param lba logical block address of the first block to read.
 */
static bool multipleBlockRead(unsigned int *buffer, unsigned int nblk,
    unsigned int lba)
{
    if(nblk==0) return true;
    while(nblk>511)
    {
        if(multipleBlockRead(buffer,511,lba)==false) return false;
        buffer+=511*512;
        nblk-=511;
        lba+=511;
    }
    if(waitForCardReady()==false) return false;
    
    if(cardType!=SDHC) lba*=512; // Convert to byte address if not SDHC
    
    //Clear both SDIO and DMA interrupt flags
    SDIO->ICR=0x7ff;
    DMA2->IFCR=DMA_IFCR_CGIF4;
    
    driverError=false;
    dmaTransferError=false;
    sdioTransferError=false;
    dmaFlags=sdioFlags=0;
    waiting=Thread::getCurrentThread();
    
    //Data transfer is considered complete once the DMA transfer complete
    //interrupt occurs, that happens when the last data was written in the
    //buffer. Both SDIO and DMA error interrupts are active to catch errors
    SDIO->MASK=SDIO_MASK_STBITERRIE | //Interrupt on start bit error
               SDIO_MASK_RXOVERRIE  | //Interrupt on rx underrun
               SDIO_MASK_TXUNDERRIE | //Interrupt on tx underrun
               SDIO_MASK_DCRCFAILIE | //Interrupt on data CRC fail
               SDIO_MASK_DTIMEOUTIE;  //Interrupt on data timeout
    DMA2_Channel4->CPAR=reinterpret_cast<unsigned int>(&SDIO->FIFO);
    DMA2_Channel4->CMAR=reinterpret_cast<unsigned int>(buffer);
	DMA2_Channel4->CNDTR=nblk*512/sizeof(unsigned int);
    DMA2_Channel4->CCR=DMA_CCR_PL_1      | //High priority DMA stream
                       DMA_CCR_MSIZE_1   | //Write 32bit at a time to RAM
					   DMA_CCR_PSIZE_1   | //Read 32bit at a time from SDIO
				       DMA_CCR_MINC      | //Increment RAM pointer
			           0                 | //Peripheral to memory direction
			           DMA_CCR_TCIE      | //Interrupt on transfer complete
                       DMA_CCR_TEIE      | //Interrupt on transfer error
			  	       DMA_CCR_EN;         //Start the DMA
    
    SDIO->DLEN=nblk*512;
    if(waiting==0)
    {
        DBGERR("Premature wakeup\n");
        driverError=true;
    }
    CmdResult cr=Command::send(nblk>1 ? Command::CMD18 : Command::CMD17,lba);
    if(cr.validateR1Response())
    {
        //Block size 512 bytes, block data xfer, from card to controller
        SDIO->DCTRL=(9<<4) | SDIO_DCTRL_DMAEN | SDIO_DCTRL_DTDIR | SDIO_DCTRL_DTEN;
        FastGlobalIrqLock dLock;
        while(waiting) Thread::IRQglobalIrqUnlockAndWait(dLock);
    } else sdioTransferError=true;
    DMA2_Channel4->CCR=0;
    while(DMA2_Channel4->CCR & DMA_CCR_EN) ; //DMA may take time to stop
    SDIO->DCTRL=0; //Disable data path state machine
    SDIO->MASK=0;

    // CMD12 is sent to end CMD18 (multiple block read), or to abort an
    // unfinished read in case of errors
    if(nblk>1 || driverError || sdioTransferError || dmaTransferError) 
    {
        cr=Command::send(Command::CMD12,0);
        if(driverError || dmaTransferError || sdioTransferError)
        {
            // CMD13 is sent to check the real status of the sdio after CMD12
            // and to reset the card in case if it gets stuck in a illegal state
            cr=Command::send(Command::CMD13,Command::getRca()<<16);
        }
    }
    if(sdioTransferError || dmaTransferError || cr.validateR1Response()==false)
    {
        displayBlockTransferError();
        ClockController::reduceClockSpeed();
        return false;
    }
    return true;
}

/**
 * \internal
 * Write a given number of contiguous 512 byte blocks to an SD/MMC card.
 * Card must be selected prior to calling this function.
 * \param buffer, a buffer whose size is 512*nblk bytes, word aligned
 * \param nblk number of blocks to write.
 * \param lba logical block address of the first block to write.
 */
static bool multipleBlockWrite(const unsigned int *buffer, unsigned int nblk,
    unsigned int lba)
{
    if(nblk==0) return true;
    while(nblk>511)
    {
        if(multipleBlockWrite(buffer,511,lba)==false) return false;
        buffer+=511*512;
        nblk-=511;
        lba+=511;
    }
    if(waitForCardReady()==false) return false;
    
    if(cardType!=SDHC) lba*=512; // Convert to byte address if not SDHC
    if(nblk>1)
    {
        CmdResult cr=Command::send(Command::ACMD23,nblk);
        if(cr.validateR1Response()==false) return false;
    }
    
    //Clear both SDIO and DMA interrupt flags
    SDIO->ICR=0x7ff;
    DMA2->IFCR=DMA_IFCR_CGIF4;
    
