fedetft/miosix-kernel/miosix/arch/drivers/sdmmc/stm32f1_sd.cpp
}

//
// class SDIODriver
//

intrusive_ref_ptr<SDIODriver> SDIODriver::instance()
{
    static KernelMutex m;
    static intrusive_ref_ptr<SDIODriver> instance;
    Lock<KernelMutex> l(m);
    if(!instance) instance=new SDIODriver();
    return instance;
}

ssize_t SDIODriver::readBlock(void* buffer, size_t size, off_t where)
{
    if(where % 512 || size % 512) return -EFAULT;
    unsigned int lba=where/512;
    unsigned int nSectors=size/512;
    Lock<KernelMutex> l(mutex);
    DBG("SDIODriver::readBlock(): nSectors=%d\n",nSectors);
    bool aligned=BufferConverter::isWordAligned(buffer);
    if(aligned==false) DBG("Buffer misaligned\n");

    for(int i=0;i<ClockController::getRetryCount();i++)
    {
        #ifndef SD_KEEP_CARD_SELECTED
        CardSelector selector;
        if(selector.succeded()==false) continue;
        #endif //SD_KEEP_CARD_SELECTED
        bool error=false;
        
        #ifndef SD_DMA
        // In the XRAM fallback code multiple sector read is implemented as
        // a sequence of single block read operations
        unsigned char *tempBuffer=reinterpret_cast<unsigned char*>(buffer);
        unsigned int tempLba=lba;
        for(unsigned int j=0;j<nSectors;j++)
        {
            unsigned int* b=BufferConverter::toWordAlignedWithoutCopy(tempBuffer);
            if(singleBlockRead(b,tempLba)==false)
            {
                error=true;
                break;
            }
            BufferConverter::toOriginalBuffer();
            tempBuffer+=512;
            tempLba++;
        }
        #else //SD_DMA
        // If we are using DMA, then check pointer alignment, and if it is
        // aligned use a single multipleBlockRead(), else use the buffer
        // converter and read a sector at a time
        if(aligned)
        {
            if(multipleBlockRead(reinterpret_cast<unsigned int*>(buffer),
                nSectors,lba)==false) error=true;
        } else {
            unsigned char *tempBuffer=reinterpret_cast<unsigned char*>(buffer);
            unsigned int tempLba=lba;
            for(unsigned int j=0;j<nSectors;j++)
            {
                unsigned int* b=BufferConverter::toWordAlignedWithoutCopy(tempBuffer);
                if(multipleBlockRead(b,1,tempLba)==false)
                {
                    error=true;
                    break;
                }
                BufferConverter::toOriginalBuffer();
                tempBuffer+=512;
                tempLba++;
            }
        }
        #endif //SD_DMA

        if(error==false)
        {
            if(i>0) DBGERR("Read: required %d retries\n",i);
            return size;
        }
    }
    return -EBADF;
}

ssize_t SDIODriver::writeBlock(const void* buffer, size_t size, off_t where)
{
    if(where % 512 || size % 512) return -EFAULT;
    unsigned int lba=where/512;
    unsigned int nSectors=size/512;
    Lock<KernelMutex> l(mutex);
    DBG("SDIODriver::writeBlock(): nSectors=%d\n",nSectors);
    bool aligned=BufferConverter::isWordAligned(buffer);
    if(aligned==false) DBG("Buffer misaligned\n");

    for(int i=0;i<ClockController::getRetryCount();i++)
    {
        #ifndef SD_KEEP_CARD_SELECTED
        CardSelector selector;
        if(selector.succeded()==false) continue;
        #endif //SD_KEEP_CARD_SELECTED
        bool error=false;

        #ifndef SD_DMA
        // In polling mode multiple sector write is implemented as
        // a sequence of single block write operations
        const unsigned char *tempBuffer=
            reinterpret_cast<const unsigned char*>(buffer);
        unsigned int tempLba=lba;
        for(unsigned int j=0;j<nSectors;j++)
        {
            const unsigned int* b=BufferConverter::toWordAligned(tempBuffer);
            if(singleBlockWrite(b,tempLba)==false)
            {
                error=true;
                break;
            }
            tempBuffer+=512;
            tempLba++;
        }
        #else //SD_DMA
        // If we are using DMA, then check pointer alignment, and if it is
        // aligned use a single multipleBlockWrite(), else use the buffer
        // converter and write a sector at a time
        if(aligned)
        {
            if(multipleBlockWrite(reinterpret_cast<const unsigned int*>(buffer),
                nSectors,lba)==false) error=true;
        } else {
            const unsigned char *tempBuffer=
                reinterpret_cast<const unsigned char*>(buffer);
            unsigned int tempLba=lba;
            for(unsigned int j=0;j<nSectors;j++)
            {
                const unsigned int* b=BufferConverter::toWordAligned(tempBuffer);
                if(multipleBlockWrite(b,1,tempLba)==false)
                {
                    error=true;
                    break;
                }
                tempBuffer+=512;
                tempLba++;
            }
        }
        #endif //SD_DMA
        
        if(error==false)
        {
            if(i>0) DBGERR("Write: required %d retries\n",i);
            return size;
        }
    }
    return -EBADF;
}

int SDIODriver::ioctl(int cmd, void* arg)
{
    DBG("SDIODriver::ioctl()\n");
    if(cmd!=IOCTL_SYNC) return -ENOTTY;
    Lock<KernelMutex> l(mutex);
    //Note: no need to select card, since status can be queried even with card
    //not selected.
    return waitForCardReady() ? 0 : -EFAULT;
}

SDIODriver::SDIODriver() : Device(Device::BLOCK)
{
    initSDIOPeripheral();

    // This is more important than it seems, since CMD55 requires the card's RCA
    // as argument. During initalization, after CMD0 the card has an RCA of zero
    // so without this line ACMD41 will fail and the card won't be initialized.
    Command::setRca(0);

    //Send card reset command
    CmdResult r=Command::send(Command::CMD0,0);
    if(r.validateError()==false) return;

    cardType=detectCardType();
    if(cardType==Invalid) return; //Card detect failed
    if(cardType==MMC) return; //MMC cards currently unsupported

    // Now give an RCA to the card. In theory we should loop and enumerate all
    // the cards but this driver supports only one card.
    r=Command::send(Command::CMD2,0);
    if(r.validateR2Response()==false) return;

    r=Command::send(Command::CMD3,0);
    if(r.validateR6Response()==false) return;
    Command::setRca(r.getResponse()>>16);
    DBG("Got RCA=%u\n",Command::getRca());
    if(Command::getRca()==0)
    {
        //RCA=0 can't be accepted, since it is used to deselect cards
        DBGERR("RCA=0 is invalid\n");
        return;
    }

    // Here we should be able to get the card's CSD
    cardSize = getCardSize();
    if (cardSize == 0)
    {
        DBGERR("Failed to get card size or card is empty\n");
    } else {
        DBG("Card size: %llu bytes\n", cardSize);
    }


    //Lastly, try selecting the card and configure the latest bits
    {
        #ifndef SD_KEEP_CARD_SELECTED
        CardSelector selector;
        if(selector.succeded()==false) return;
        #else //SD_KEEP_CARD_SELECTED
        //Select card here, and keep it selected indefinitely
        r=Command::send(Command::CMD7,Command::getRca()<<16);
        if(r.validateR1Response()==false) return;
        #endif //SD_KEEP_CARD_SELECTED

        r=Command::send(Command::CMD13,Command::getRca()<<16);//Get status
        if(r.validateR1Response()==false) return;
        if(r.getState()!=4) //4=Tran state
        {
            DBGERR("CMD7 was not able to select card\n");
            return;
        }

        r=Command::send(Command::ACMD6,2);   //Set 4 bit bus width
        if(r.validateR1Response()==false) return;

        if(cardType!=SDHC)
        {
            r=Command::send(Command::CMD16,512); //Set 512Byte block length
            if(r.validateR1Response()==false) return;
        }
    }

    // Now that card is initialized, perform self calibration of maximum
    // possible read/write speed. This as a side effect enables 4bit bus width.
    ClockController::calibrateClockSpeed(this);

    DBG("SDIO init: Success\n");
}

} //namespace miosix
